Repository: prathameshpatil1001/temp
Catalog: temp/Localizable.xcstrings
Source language: en
Languages: hi, kn, mr, ta, te

source: Mos
hi: महीने
mr: महिने
ta: மாதங்கள்
te: నెలలు

source: Most recent month
hi: सबसे हाल का महीना
kn: ಇತ್ತೀಚಿನ ತಿಂಗಳು
mr: सर्वात अलीकडील महिना
ta: அண்மைய மாதம்
te: ఇటీవలి నెల

source: My Applications
hi: मेरे आवेदन
kn: ನನ್ನ ಅರ್ಜಿಗಳು
mr: माझे अर्ज
ta: என் விண்ணப்பங்கள்
te: నా దరఖాస్తులు

source: Name
hi: नाम
kn: ಹೆಸರು
mr: नाव
ta: பெயர்
te: పేరు

source: Net Banking & Cards
hi: नेट बैंकिंग और कार्ड्स
kn: ನೆಟ್ ಬ್ಯಾಂಕಿಂಗ್ ಮತ್ತು ಕಾರ್ಡ್‌ಗಳು
mr: नेट बँकिंग आणि कार्ड्स
ta: நெட் பேங்கிங் மற்றும் கார்டுகள்
te: నెట్ బ్యాంకింగ్ మరియు కార్డులు

source: Never miss an EMI. Automate your payments safely.
hi: कभी EMI न चूकें। अपने भुगतान सुरक्षित रूप से स्वचालित करें।
kn: ಯಾವ EMIಯನ್ನೂ ತಪ್ಪಿಸಬೇಡಿ. ನಿಮ್ಮ ಪಾವತಿಗಳನ್ನು ಸುರಕ್ಷಿತವಾಗಿ ಸ್ವಯಂಚಾಲಿತಗೊಳಿಸಿ.
mr: EMI कधीही चुकवू नका. तुमची पेमेंट्स सुरक्षितपणे ऑटोमेट करा.
ta: ஒரு EMIயும் தவறவிடாதீர்கள். உங்கள் கட்டணங்களை பாதுகாப்பாக தானியக்கப்படுத்துங்கள்.
te: ఒక EMI కూడా మిస్ కావద్దు. మీ చెల్లింపులను సురక్షితంగా ఆటోమేట్ చేయండి.

source: New Tenure
hi: नई अवधि
kn: ಹೊಸ ಅವಧಿ
mr: नवीन कालावधी
ta: புதிய காலம்
te: కొత్త కాలపరిమితి

source: New: %lld months
hi: नया: %lld महीने
kn: ಹೊಸದು: %lld ತಿಂಗಳುಗಳು

source: New: ₹%@
hi: नया: ₹%@
kn: ಹೊಸದು: ₹%@
mr: नवीन: ₹%@
ta: புதியது: ₹%@
te: కొత్తది: ₹%@

source: Next EMI
hi: अगली EMI
kn: ಮುಂದಿನ EMI
mr: पुढील EMI
ta: அடுத்த EMI
te: తదుపరి EMI

source: Next EMI Date
hi: अगली EMI तिथि
kn: ಮುಂದಿನ EMI ದಿನಾಂಕ
mr: पुढील EMI तारीख
ta: அடுத்த EMI தேதி
te: తదుపరి EMI తేదీ

source: Next EMI Due
hi: अगली EMI देय
kn: ಮುಂದಿನ EMI ಬಾಕಿ
mr: पुढील EMI देय
ta: அடுத்த EMI நிலுவை
te: తదుపరి EMI చెల్లించాల్సింది

source: No Collateral
hi: कोई गिरवी नहीं
kn: ಜಾಮೀನು ಅಗತ್ಯವಿಲ್ಲ
mr: तारण नाही
ta: அடமானம் இல்லை
te: కాలేటరల్ లేదు

source: No hidden charges. Instant disbursal upon final verification.
hi: कोई छिपे शुल्क नहीं। अंतिम सत्यापन के बाद तुरंत वितरण।
kn: ಯಾವುದೇ ಗೂಢ ಶುಲ್ಕಗಳಿಲ್ಲ. ಅಂತಿಮ ಪರಿಶೀಲನೆಯ ನಂತರ ತಕ್ಷಣದ ವಿತರಣೆ.
mr: लपलेले शुल्क नाहीत. अंतिम पडताळणीनंतर त्वरित वितरण.
ta: மறைமுக கட்டணங்கள் இல்லை. இறுதி சரிபார்ப்புக்குப் பிறகு உடனடி வழங்கல்.
te: దాచిన ఛార్జీలు లేవు. తుది ధృవీకరణ తర్వాత వెంటనే విడుదల.

source: Not now
hi: अभी नहीं
kn: ಈಗ ಬೇಡ
mr: आत्ता नाही
ta: இப்போது வேண்டாம்
te: ఇప్పుడు వద్దు

source: Notifications
hi: सूचनाएं
kn: ಅಧಿಸೂಚನೆಗಳು
mr: सूचना
ta: அறிவிப்புகள்
te: నోటిఫికేషన్లు

source: OK
hi: ठीक है
kn: ಸರಿ
mr: ठीक आहे
ta: சரி
te: సరే

source: One-time code
hi: वन-टाइम कोड
kn: ಒಮ್ಮೆಯ ಕೋಡ್
mr: एकवेळ कोड
ta: ஒருமுறை குறியீடு
te: ఒకసారి ఉపయోగించే కోడ్

source: One-Time Password Code
hi: वन-टाइम पासवर्ड कोड
kn: ಒಮ್ಮೆ ಬಳಕೆಯ ಪಾಸ್‌ವರ್ಡ್ ಕೋಡ್
mr: वन-टाइम पासवर्ड कोड
ta: ஒருமுறை கடவுச்சொல் குறியீடு
te: వన్-టైమ్ పాస్‌వర్డ్ కోడ్

source: Original Tenure
hi: मूल अवधि
kn: ಮೂಲ ಅವಧಿ
mr: मूळ कालावधी
ta: அசல் காலம்
te: మూల కాలపరిమితి

source: Original: %lld months
hi: मूल: %lld महीने
kn: ಮೂಲ: %lld ತಿಂಗಳುಗಳು

source: Our team has successfully verified your identity and income.
hi: हमारी टीम ने आपकी पहचान और आय सफलतापूर्वक सत्यापित कर ली है।
kn: ನಮ್ಮ ತಂಡವು ನಿಮ್ಮ ಗುರುತು ಮತ್ತು ಆದಾಯವನ್ನು ಯಶಸ್ವಿಯಾಗಿ ಪರಿಶೀಲಿಸಿದೆ.
mr: आमच्या टीमने तुमची ओळख आणि उत्पन्न यशस्वीरित्या पडताळले आहे.
ta: எங்கள் குழு உங்கள் அடையாளத்தையும் வருமானத்தையும் வெற்றிகரமாக சரிபார்த்துள்ளது.
te: మా బృందం మీ గుర్తింపు మరియు ఆదాయాన్ని విజయవంతంగా ధృవీకరించింది.

source: Outstanding Breakdown
hi: बकाया विवरण
kn: ಬಾಕಿಯ ವಿಭಜನೆ
mr: थकबाकी विभागणी
ta: நிலுவை பிரிவு
te: బాకీ విభజన

source: Outstanding Balance
hi: बकाया शेष राशि
kn: ಬಾಕಿ ಉಳಿಕೆ
mr: थकबाकी शिल्लक
ta: நிலுவை இருப்பு
te: బాకీ నిల్వ

source: Overdue Payment
hi: अतिदेय भुगतान
kn: ಮೀರಿದ ಪಾವತಿ
mr: थकित पेमेंट
ta: நிலுவை கட்டணம்
te: గడువు దాటిన చెల్లింపు

source: p.a.
hi: प्रति वर्ष
mr: प्रति वर्ष
ta: ஆண்டுக்கு
te: సంవత్సరానికి

source: Paid
hi: भुगतान किया गया
kn: ಪಾವತಿಸಲಾಗಿದೆ
mr: भरले
ta: செலுத்தப்பட்டது
te: చెల్లించబడింది

source: PAN Card
hi: PAN कार्ड
kn: PAN ಕಾರ್ಡ್
mr: PAN कार्ड
ta: PAN அட்டை
te: PAN కార్డ్

source: PAN Number
hi: PAN नंबर
kn: PAN ಸಂಖ್ಯೆ
mr: PAN नंबर
ta: PAN எண்
te: PAN నంబర్

source: Part Payment Amount
hi: आंशिक भुगतान राशि
kn: ಭಾಗ ಪಾವತಿ ಮೊತ್ತ
mr: आंशिक पेमेंट रक्कम
ta: பகுதி கட்டண தொகை
te: భాగ చెల్లింపు మొత్తం

source: Passkey
hi: पासकी
mr: पासकी
ta: பாஸ்கீ
te: పాస్‌కీ

source: Passkey configured on this device.
hi: इस डिवाइस पर पासकी कॉन्फ़िगर की गई है।
mr: या डिव्हाइसवर पासकी कॉन्फिगर केली आहे.
ta: இந்த சாதனத்தில் பாஸ்கீ அமைக்கப்பட்டுள்ளது.
te: ఈ పరికరంలో పాస్‌కీ కాన్ఫిగర్ చేయబడింది.

source: Passkey Setup
hi: पासकी सेटअप
kn: ಪಾಸ್‌ಕಿ ಸೆಟಪ್
mr: पासकी सेटअप
ta: பாஸ்கீ அமைப்பு
te: పాస్‌కీ సెటప్

source: Past Applications
hi: पिछले आवेदन
kn: ಹಿಂದಿನ ಅರ್ಜಿಗಳು
mr: मागील अर्ज
ta: முந்தைய விண்ணப்பங்கள்
te: గత దరఖాస్తులు

source: Pay ₹%@ Now
hi: अभी ₹%@ भुगतान करें
mr: आता ₹%@ भरा
ta: இப்போது ₹%@ செலுத்தவும்
te: ఇప్పుడే ₹%@ చెల్లించండి

source: Pay EMI
hi: EMI भरें
kn: EMI ಪಾವತಿಸಿ
mr: EMI भरा
ta: EMI செலுத்து
te: EMI చెల్లించు

source: Pay Now
hi: अभी भुगतान करें
kn: ಈಗಲೇ ಪಾವತಿಸಿ
mr: आता भरा
ta: இப்போது செலுத்து
te: ఇప్పుడు చెల్లించండి

source: Payment History
hi: भुगतान इतिहास
kn: ಪಾವತಿ ಇತಿಹಾಸ
mr: पेमेंट इतिहास
ta: கட்டண வரலாறு
te: చెల్లింపు చరితం

source: Payment Successful
hi: भुगतान सफल
kn: ಪಾವತಿ ಯಶಸ್ವಿಯಾಗಿದೆ
mr: पेमेंट यशस्वी
ta: கட்டணம் வெற்றிகரமாக முடிந்தது
te: చెల్లింపు విజయవంతమైంది

source: Payment Successful!
hi: भुगतान सफल!
kn: ಪಾವತಿ ಯಶಸ್ವಿಯಾಗಿದೆ!
mr: पेमेंट यशस्वी!
ta: கட்டணம் வெற்றி!
te: చెల్లింపు విజయవంతం!

source: Pending approval.
hi: स्वीकृति लंबित।
kn: ಅನುಮೋದನೆ ಬಾಕಿಯಿದೆ.
mr: मंजुरी प्रलंबित.
ta: ஒப்புதல் நிலுவையில் உள்ளது.
te: ఆమోదం పెండింగ్‌లో ఉంది.

source: Personal Loan
hi: पर्सनल लोन
kn: ವೈಯಕ್ತಿಕ ಸಾಲ
mr: वैयक्तिक कर्ज
ta: தனிநபர் கடன்
te: వ్యక్తిగత రుణం

source: Personal Loan • APP-9824-XT
hi: व्यक्तिगत ऋण • APP-9824-XT
kn: ವೈಯಕ್ತಿಕ ಸಾಲ • APP-9824-XT
mr: वैयक्तिक कर्ज • APP-9824-XT
ta: தனிநபர் கடன் • APP-9824-XT
te: వ్యక్తిగత రుణం • APP-9824-XT

source: Phone
hi: फोन
kn: ಫೋನ್
mr: फोन
ta: தொலைபேசி
te: ఫోన్

source: Phone Number
hi: फोन नंबर
kn: ಫೋನ್ ಸಂಖ್ಯೆ
mr: फोन नंबर
ta: தொலைபேசி எண்
te: ఫోన్ నంబర్

source: Phone number can only be changed via Support.
hi: फोन नंबर केवल सपोर्ट के माध्यम से बदला जा सकता है।
kn: ಫೋನ್ ಸಂಖ್ಯೆಯನ್ನು ಬೆಂಬಲದ ಮೂಲಕ ಮಾತ್ರ ಬದಲಾಯಿಸಬಹುದು.
mr: फोन नंबर फक्त सपोर्टमार्फत बदलता येतो.
ta: தொலைபேசி எண்ணை ஆதரவு மூலம் மட்டுமே மாற்ற முடியும்.
te: ఫోన్ నంబర్‌ను సపోర్ట్ ద్వారా మాత్రమే మార్చవచ్చు.

source: Pincode
hi: पिनकोड
kn: ಪಿನ್‌ಕೋಡ್
mr: पिनकोड
ta: அஞ்சல் குறியீடு
te: పిన్‌కోడ్

source: Please complete all sections before submitting.
hi: जमा करने से पहले सभी अनुभाग पूरे करें।
kn: ಸಲ್ಲಿಸುವ ಮೊದಲು ಎಲ್ಲಾ ವಿಭಾಗಗಳನ್ನು ಪೂರ್ಣಗೊಳಿಸಿ.
mr: सादर करण्यापूर्वी सर्व विभाग पूर्ण करा.
ta: சமர்ப்பிப்பதற்கு முன் அனைத்து பிரிவுகளையும் பூர்த்தி செய்யவும்.
te: సమర్పించే ముందు అన్ని విభాగాలను పూర్తి చేయండి.

source: Please sign inside the box to continue.
hi: जारी रखने के लिए बॉक्स के अंदर हस्ताक्षर करें।
kn: ಮುಂದುವರಿಸಲು ಬಾಕ್ಸ್ ಒಳಗೆ ಸಹಿ ಮಾಡಿ.
mr: पुढे जाण्यासाठी बॉक्सच्या आत सही करा.
ta: தொடர பெட்டிக்குள் கையொப்பமிடவும்.
te: కొనసాగడానికి పెట్టె లోపల సంతకం చేయండి.

source: Please verify your information before final submission.
hi: अंतिम जमा करने से पहले अपनी जानकारी सत्यापित करें।
kn: ಅಂತಿಮ ಸಲ್ಲಿಕೆಗೆ ಮುನ್ನ ನಿಮ್ಮ ಮಾಹಿತಿಯನ್ನು ಪರಿಶೀಲಿಸಿ.
mr: अंतिम सादरीकरणापूर्वी तुमची माहिती पडताळा.
ta: இறுதி சமர்ப்பிப்புக்கு முன் உங்கள் தகவலை சரிபார்க்கவும்.
te: చివరి సమర్పణకు ముందు మీ సమాచారాన్ని ధృవీకరించండి.

source: Poor
hi: कमज़ोर
kn: ಕಳಪೆ
mr: कमकुवत
ta: மோசம்
te: బలహీనమైనది

source: Pre-approved at 10.5% p.a.
hi: 10.5% प्रतिवर्ष पर प्री-अप्रूव्ड
mr: 10.5% वार्षिक दराने पूर्व-मंजूर
ta: 10.5% ஆண்டு விகிதத்தில் முன்-அனுமதி
te: 10.5% వార్షిక వడ్డీపై ముందస్తు ఆమోదం

source: Preferences
hi: प्राथमिकताएं
kn: ಆದ್ಯತೆಗಳು
mr: प्राधान्ये
ta: விருப்பங்கள்
te: ప్రాధాన్యతలు

source: Prepayment Calculator
hi: प्रीपेमेंट कैलकुलेटर
kn: ಪೂರ್ವಪಾವತಿ ಗಣಕ
mr: आगाऊ भरणा कॅल्क्युलेटर
ta: முன்கூட்டிய கட்டணம் கணிப்பான்
te: ముందస్తు చెల్లింపు కాలిక్యులేటర్

source: Prepayment Query
hi: प्रीपेमेंट प्रश्न
kn: ಪೂರ್ವಪಾವತಿ ಪ್ರಶ್ನೆ
mr: प्रीपेमेंट चौकशी
ta: முன்பணம் கேள்வி
te: ముందస్తు చెల్లింపు ప్రశ్న

source: Prepayments are processed against your principal outstanding. Your monthly EMI will remain the same, but your tenure will drop.
hi: प्रीपेमेंट आपके बकाया मूलधन पर समायोजित होते हैं। आपकी मासिक EMI समान रहेगी, लेकिन अवधि कम होगी।
mr: आगाऊ पेमेंट तुमच्या थकित मूळ रकमेवर समायोजित केली जातात. तुमची मासिक EMI तीच राहील, पण कालावधी कमी होईल.
ta: முன்கூட்டிய கட்டணங்கள் உங்கள் நிலுவை முதன்மைத் தொகையில் சமநிலைப்படுத்தப்படும். உங்கள் மாதாந்திர EMI அதேபோல இருக்கும், ஆனால் காலம் குறையும்.
te: ముందస్తు చెల్లింపులు మీ బాకీ అసలు మొత్తానికి సర్దుబాటు చేయబడతాయి. మీ నెలవారీ EMI అలాగే ఉంటుంది, కానీ కాలపరిమితి తగ్గుతుంది.

source: Preview of uploaded document
hi: अपलोड किए गए दस्तावेज़ का प्रीव्यू
kn: ಅಪ್‌ಲೋಡ್ ಮಾಡಿದ ದಾಖಲೆಯ ಮುನ್ನೋಟ
mr: अपलोड केलेल्या दस्तऐवजाचा प्रीव्ह्यू
ta: பதிவேற்றப்பட்ட ஆவணத்தின் முன்னோட்டம்
te: అప్‌లోడ్ చేసిన పత్రం ప్రివ్యూ

source: Principal
hi: मूल राशि
kn: ಮೂಲಧನ
mr: मूळ रक्कम
ta: அசல் தொகை
te: మూలధనం

source: Principal Amount
hi: मूलधन राशि
kn: ಮೂಲಧನ ಮೊತ್ತ
mr: मूळ रक्कम
ta: முதன்மைத் தொகை
te: అసలు మొత్తం

source: Principal Remaining
hi: शेष मूलधन
kn: ಉಳಿದಿರುವ ಮೂಲಧನ
mr: उर्वरित मूळ रक्कम
ta: மீதமுள்ள முதன்மைத் தொகை
te: మిగిలిన అసలు మొత్తం

source: Proceed to Apply
hi: आवेदन के लिए आगे बढ़ें
kn: ಅರ್ಜಿಗೆ ಮುಂದುವರಿಸಿ
mr: अर्ज करण्यासाठी पुढे जा
ta: விண்ணப்பிக்க தொடரவும்
te: దరఖాస్తుకు కొనసాగండి

source: Proceed to Pay
hi: भुगतान के लिए आगे बढ़ें
kn: ಪಾವತಿಗೆ ಮುಂದುವರಿಸಿ
mr: पेमेंटसाठी पुढे जा
ta: செலுத்த தொடரவும்
te: చెల్లింపుకు కొనసాగండి

source: Processing Fee
hi: प्रोसेसिंग शुल्क
kn: ಪ್ರಕ್ರಿಯಾ ಶುಲ್ಕ
mr: प्रक्रिया शुल्क
ta: செயலாக்க கட்டணம்
te: ప్రాసెసింగ్ రుసుము

source: Processing Fee (1.5%)
hi: प्रोसेसिंग शुल्क (1.5%)
mr: प्रक्रिया शुल्क (1.5%)
ta: செயலாக்க கட்டணம் (1.5%)
te: ప్రాసెసింగ్ రుసుము (1.5%)

source: Profile
hi: प्रोफ़ाइल
kn: ಪ್ರೊಫೈಲ್
mr: प्रोफाइल
ta: சுயவிவரம்
te: ప్రొఫైల్

source: Profile summary
hi: प्रोफ़ाइल सारांश
kn: ಪ್ರೊಫೈಲ್ ಸಂಕ್ಷಿಪ್ತ
mr: प्रोफाइल सारांश
ta: சுயவிவர சுருக்கம்
te: ప్రొఫైల్ సారాంశం

source: Push Notifications
hi: पुश सूचनाएं
kn: ಪುಶ್ ಅಧಿಸೂಚನೆಗಳು
mr: पुश सूचना
ta: புஷ் அறிவிப்புகள்
te: పుష్ నోటిఫికేషన్లు

source: Quick Actions
hi: त्वरित क्रियाएं
kn: ತ್ವರಿತ ಕ್ರಿಯೆಗಳು
mr: जलद कृती
ta: விரைவு செயல்கள்
te: త్వరిత చర్యలు

source: Quick Disbursal
hi: त्वरित वितरण
kn: ತ್ವರಿತ ವಿತರಣೆ
mr: जलद वितरण
ta: விரைவான வழங்கல்
te: త్వరిత చెల్లింపు

source: Quick login is turned off for this account on this device.
hi: इस डिवाइस पर इस खाते के लिए क्विक लॉगिन बंद है।
mr: या डिव्हाइसवर या खात्यासाठी क्विक लॉगिन बंद आहे.
ta: இந்த சாதனத்தில் இந்த கணக்கிற்கான விரைவு உள்நுழைவு அணைக்கப்பட்டுள்ளது.
te: ఈ పరికరంలో ఈ ఖాతాకు క్విక్ లాగిన్ ఆఫ్ చేయబడింది.

source: Reach 750 for Gold Tier
hi: गोल्ड टियर के लिए 750 तक पहुंचें
kn: Gold ಹಂತಕ್ಕೆ 750 ತಲುಪಿ
mr: गोल्ड टियरसाठी 750 पर्यंत पोहोचा
ta: கோல்ட் நிலைக்கு 750 எட்டுங்கள்
te: గోల్డ్ స్థాయికి 750 చేరుకోండి

source: Ready to authenticate
hi: प्रमाणीकरण के लिए तैयार
mr: प्रमाणीकरणासाठी तयार
ta: அங்கீகரிக்க தயாராக உள்ளது
te: ధృవీకరణకు సిద్ధంగా ఉంది

source: Ready to continue
hi: जारी रखने के लिए तैयार
kn: ಮುಂದುವರಿಸಲು ಸಿದ್ಧವಾಗಿದೆ
mr: सुरू ठेवण्यासाठी तयार
ta: தொடர தயாராக உள்ளது
te: కొనసాగించడానికి సిద్ధంగా ఉంది

source: Ready to submit
hi: जमा करने के लिए तैयार
kn: ಸಲ್ಲಿಸಲು ಸಿದ್ಧವಾಗಿದೆ
mr: सादर करण्यास तयार
ta: சமர்ப்பிக்க தயாராக உள்ளது
te: సమర్పించడానికి సిద్ధంగా ఉంది

source: Ready to upload
hi: अपलोड के लिए तैयार
kn: ಅಪ್‌ಲೋಡ್ ಮಾಡಲು ಸಿದ್ಧವಾಗಿದೆ
mr: अपलोडसाठी तयार
ta: பதிவேற்ற தயாராக உள்ளது
te: అప్‌లోడ్ చేయడానికి సిద్ధంగా ఉంది

source: Reason for Rejection
hi: अस्वीकृति का कारण
kn: ತಿರಸ್ಕಾರದ ಕಾರಣ
mr: नकारण्याचे कारण
ta: நிராகரிப்பிற்கான காரணம்
te: తిరస్కరణకు కారణం

source: Recent Enquiries
hi: हाल की पूछताछ
kn: ಇತ್ತೀಚಿನ ವಿಚಾರಣೆಗಳು
mr: अलीकडील चौकशा
ta: சமீபத்திய விசாரணைகள்
te: ఇటీవలి విచారణలు

source: Recommended
hi: अनुशंसित
kn: ಶಿಫಾರಸು ಮಾಡಲಾಗಿದೆ
mr: शिफारस केलेले
ta: பரிந்துரைக்கப்பட்டது
te: సిఫార్సు చేయబడింది

source: Reduce Motion
hi: मोशन कम करें
kn: ಚಲನವಲನವನ್ನು ಕಡಿಮೆಮಾಡಿ
mr: हालचाल कमी करा
ta: இயக்கத்தை குறை
te: మోషన్ తగ్గించండి

source: Remaining Balance
hi: शेष बैलेंस
kn: ಉಳಿದಿರುವ ಬಾಕಿ
mr: उर्वरित शिल्लक
ta: மீதமுள்ள இருப்பு
te: మిగిలిన బాకీ

source: Repayment History
hi: भुगतान इतिहास
kn: ಮರುಪಾವತಿ ಇತಿಹಾಸ
mr: परतफेड इतिहास
ta: திருப்பிச் செலுத்தும் வரலாறு
te: చెల్లింపు చరిత్ర

source: Repayments
hi: पुनर्भुगतान
kn: ಮರುಪಾವತಿಗಳು
mr: परतफेड
ta: திருப்பிச் செலுத்தல்கள்
te: చెల్లింపులు

source: Resend code
hi: कोड फिर से भेजें
kn: ಕೋಡ್ ಮರುಕಳುಹಿಸಿ
mr: कोड पुन्हा पाठवा
ta: குறியீட்டை மீண்டும் அனுப்பு
te: కోడ్‌ను మళ్లీ పంపండి

source: Resend code in %llds
hi: %lld सेकंड में कोड फिर भेजें
mr: %lld सेकंदात कोड पुन्हा पाठवा
ta: %lld வினாடிகளில் குறியீட்டை மீண்டும் அனுப்பவும்
te: %lld సెకండ్లలో కోడ్‌ను మళ్లీ పంపండి

source: Resume Application
hi: आवेदन फिर शुरू करें
kn: ಅರ್ಜಿಯನ್ನು ಮುಂದುವರಿಸಿ
mr: अर्ज पुन्हा सुरू करा
ta: விண்ணப்பத்தைத் தொடரவும்
te: దరఖాస్తును మళ్లీ ప్రారంభించండి

source: Retake / Upload Again
hi: फिर से लें / दोबारा अपलोड करें
kn: ಮತ್ತೆ ತೆಗೆದು / ಮರುಅಪ್‌ಲೋಡ್ ಮಾಡಿ
mr: पुन्हा घ्या / पुन्हा अपलोड करा
ta: மீண்டும் எடு / மீண்டும் பதிவேற்று
te: మళ్లీ తీయండి / మళ్లీ అప్‌లోడ్ చేయండి

source: Retry Verification
hi: सत्यापन पुनः प्रयास करें
kn: ಪರಿಶೀಲನೆಯನ್ನು ಮರುಪ್ರಯತ್ನಿಸಿ
mr: पडताळणी पुन्हा करा
ta: சரிபார்ப்பை மீண்டும் முயற்சிக்கவும்
te: ధృవీకరణను మళ్లీ ప్రయత్నించండి

source: Review & Submit
hi: समीक्षा करें और जमा करें
kn: ಪರಿಶೀಲಿಸಿ ಮತ್ತು ಸಲ್ಲಿಸಿ
mr: पुनरावलोकन करा आणि सबमिट करा
ta: மதிப்பாய்வு செய்து சமர்ப்பி
te: సమీక్షించి సమర్పించండి

source: Review Details
hi: विवरण की समीक्षा करें
kn: ವಿವರಗಳನ್ನು ಪರಿಶೀಲಿಸಿ
mr: तपशील पाहा
ta: விவரங்களை பரிசீலிக்கவும்
te: వివరాలను సమీక్షించండి

source: Review Document
hi: दस्तावेज़ की समीक्षा करें
kn: ದಾಖಲೆ ಪರಿಶೀಲಿಸಿ
mr: दस्तऐवज पाहा
ta: ஆவணத்தை பரிசீலிக்கவும்
te: పత్రాన్ని సమీక్షించండి

source: Review the submitted details, retake any missing proofs, and submit again for approval.
hi: जमा किए गए विवरण की समीक्षा करें, कोई भी छूटा हुआ प्रमाण फिर से अपलोड करें, और अनुमोदन के लिए दोबारा सबमिट करें।
kn: ಸಲ್ಲಿಸಿದ ವಿವರಗಳನ್ನು ಪರಿಶೀಲಿಸಿ, ಕಳೆದುಹೋಗಿರುವ ಸಾಕ್ಷ್ಯಗಳನ್ನು ಮರುಪಡೆಯಿರಿ ಮತ್ತು ಅನುಮೋದನೆಗಾಗಿ ಮತ್ತೆ ಸಲ್ಲಿಸಿ.
mr: सबमिट केलेल्या तपशीलांची पाहणी करा, राहिलेली कागदपत्रे पुन्हा अपलोड करा आणि मंजुरीसाठी पुन्हा सबमिट करा.
ta: சமர்ப்பித்த விவரங்களை பரிசீலித்து, குறைந்துள்ள ஆதாரங்களை மீண்டும் சேர்த்து, அங்கீகாரத்திற்காக மறுபடியும் சமர்ப்பிக்கவும்.
te: సమర్పించిన వివరాలను పరిశీలించి, మిస్ అయిన ప్రూఫ్‌లను మళ్లీ జోడించి, ఆమోదం కోసం తిరిగి సమర్పించండి.

source: Review your details before we send them for verification.
hi: सत्यापन के लिए भेजने से पहले अपने विवरण की समीक्षा करें।
kn: ಪರಿಶೀಲನೆಗೆ ಕಳುಹಿಸುವ ಮೊದಲು ನಿಮ್ಮ ವಿವರಗಳನ್ನು ಪರಿಶೀಲಿಸಿ.
mr: पडताळणीसाठी पाठवण्यापूर्वी तुमचे तपशील पाहा.
ta: சரிபார்ப்புக்கு அனுப்பும் முன் உங்கள் விவரங்களை பரிசீலிக்கவும்.
te: ధృవీకరణకు పంపించే ముందు మీ వివరాలను సమీక్షించండి.

source: Salary Slip
hi: वेतन पर्ची
kn: ವೇತನ ಸ್ಲಿಪ್
mr: पगार पर्ची
ta: சம்பள சீட்டு
te: జీత స్లిప్

source: Save
hi: सहेजें
kn: ಉಳಿಸಿ
mr: जतन करा
ta: சேமிக்கவும்
te: సేవ్ చేయండి

source: Save Changes
hi: परिवर्तन सहेजें
kn: ಬದಲಾವಣೆಗಳನ್ನು ಉಳಿಸಿ
mr: बदल जतन करा
ta: மாற்றங்களை சேமிக்கவும்
te: మార్పులను సేవ్ చేయండి

source: Savings Insights
hi: बचत अंतर्दृष्टि
kn: ಉಳಿತಾಯ ಒಳನೋಟಗಳು
mr: बचत आकलन
ta: சேமிப்பு பார்வைகள்
te: సేవింగ్స్ ఇన్‌సైట్స్

source: Scan this code in your authenticator app to finish securing your account.
hi: अपने खाते की सुरक्षा पूरी करने के लिए अपने ऑथेंटिकेटर ऐप में इस कोड को स्कैन करें।
mr: तुमचे खाते सुरक्षित करण्यासाठी हा कोड तुमच्या ऑथेंटिकेटर अॅपमध्ये स्कॅन करा.
ta: உங்கள் கணக்கை பாதுகாப்பாக முடிக்க உங்கள் அங்கீகரிப்பு செயலியில் இந்த குறியீட்டை ஸ்கேன் செய்யவும்.
te: మీ ఖాతా భద్రతను పూర్తిచేయడానికి మీ ఆథెంటికేటర్ యాప్‌లో ఈ కోడ్‌ను స్కాన్ చేయండి.

source: Schedule
hi: अनुसूची
kn: ವೇಳಾಪಟ್ಟಿ
mr: वेळापत्रक
ta: அட்டவணை
te: షెడ్యూల్

source: Scheduled EMI
hi: निर्धारित EMI
kn: ನಿಗದಿತ EMI
mr: नियोजित EMI
ta: திட்டமிட்ட EMI
te: షెడ్యూల్ చేసిన EMI

source: Score
hi: स्कोर
kn: ಅಂಕ
mr: स्कोअर
ta: மதிப்பெண்
te: స్కోర్

source: Score Breakdown
hi: स्कोर विवरण
kn: ಅಂಕ ವಿಭಜನೆ
mr: स्कोअर विभागणी
ta: மதிப்பெண் பிரிவு
te: స్కోర్ విభజన

source: Score History
hi: स्कोर इतिहास
kn: ಅಂಕ ಇತಿಹಾಸ
mr: स्कोअर इतिहास
ta: மதிப்பெண் வரலாறு
te: స్కోర్ చరితం

source: Score Overview
hi: स्कोर अवलोकन
kn: ಅಂಕ ಅವಲೋಕನ
mr: स्कोअर आढावा
ta: மதிப்பெண் கண்ணோட்டம்
te: స్కోర్ అవలోకనం

source: Search conversations...
hi: बातचीत खोजें...
kn: ಸಂಭಾಷಣೆಗಳನ್ನು ಹುಡುಕಿ...
mr: संभाषणे शोधा...
ta: உரையாடல்களைத் தேடு...
te: సంభాషణలను వెతకండి...

source: Security
hi: सुरक्षा
kn: ಭದ್ರತೆ
mr: सुरक्षा
ta: பாதுகாப்பு
te: భద్రత

source: Security & Alerts
hi: सुरक्षा और अलर्ट
kn: ಭದ್ರತೆ ಮತ್ತು ಎಚ್ಚರಿಕೆಗಳು
mr: सुरक्षा आणि अलर्ट
ta: பாதுகாப்பு மற்றும் எச்சரிக்கைகள்
te: భద్రత మరియు అలర్ట్లు

source: See how a lump-sum payment reduces your debt.
hi: देखें कि एकमुश्त भुगतान आपका ऋण कैसे कम करता है।
kn: ಒಂದು ಒಮ್ಮೆ ಪಾವತಿ ನಿಮ್ಮ ಸಾಲವನ್ನು ಹೇಗೆ ಕಡಿಮೆಮಾಡುತ್ತದೆ ನೋಡಿ.
mr: एकरकमी पेमेंटमुळे तुमचे कर्ज कसे कमी होते ते पहा.
ta: ஒரே தொகை கட்டணம் உங்கள் கடனை எப்படி குறைக்கிறது என்பதைப் பாருங்கள்.
te: ఒక్కసారిగా చేసే చెల్లింపు మీ రుణాన్ని ఎలా తగ్గిస్తుందో చూడండి.

source: See how the
hi: देखें कि
mr: पाहा की
ta: எப்படி என்று பாருங்கள்
te: ఎలా ఉందో చూడండి

source: See how the %@ stacks up against standard market rates.
hi: देखें कि %@ मानक बाजार दरों की तुलना में कैसा है।
mr: %@ ची मानक बाजार दरांशी तुलना कशी होते ते पहा.
ta: %@ நிலையான சந்தை விகிதங்களுடன் எப்படி ஒப்பிடப்படுகிறது என்பதைப் பாருங்கள்.
te: %@ సాధారణ మార్కెట్ రేట్లతో ఎలా సరిపోలుతుందో చూడండి.

source: Select a document, then choose how you want to add it.
hi: एक दस्तावेज़ चुनें, फिर उसे कैसे जोड़ना है यह चुनें।
kn: ಒಂದು ದಾಖಲೆಯನ್ನು ಆಯ್ಕೆಮಾಡಿ, ನಂತರ ಅದನ್ನು ಹೇಗೆ ಸೇರಿಸಲು ಬಯಸುತ್ತೀರಿ ಎಂದು ಆರಿಸಿ.
mr: दस्तऐवज निवडा, मग तो कसा जोडायचा ते ठरवा.
ta: ஒரு ஆவணத்தைத் தேர்ந்து, அதை எப்படிச் சேர்ப்பது என்று தேர்வு செய்யவும்.
te: ఒక పత్రాన్ని ఎంచుకుని, దాన్ని ఎలా జోడించాలో ఎంచుకోండి.

source: Select Bank Account
hi: बैंक खाता चुनें
kn: ಬ್ಯಾಂಕ್ ಖಾತೆಯನ್ನು ಆಯ್ಕೆಮಾಡಿ
mr: बँक खाते निवडा
ta: வங்கி கணக்கைத் தேர்ந்தெடுக்கவும்
te: బ్యాంక్ ఖాతాను ఎంచుకోండి

source: Select how you would like to securely complete your sign in.
hi: चुनें कि आप अपना साइन इन सुरक्षित रूप से कैसे पूरा करना चाहते हैं।
kn: ನೀವು ನಿಮ್ಮ ಲಾಗಿನ್ ಅನ್ನು ಸುರಕ್ಷಿತವಾಗಿ ಹೇಗೆ ಪೂರ್ಣಗೊಳಿಸಲು ಬಯಸುತ್ತೀರಿ ಎಂದು ಆಯ್ಕೆಮಾಡಿ.
mr: तुम्हाला सुरक्षितपणे साइन इन कसे पूर्ण करायचे आहे ते निवडा.
ta: உங்கள் உள்நுழைவை பாதுகாப்பாக எப்படிச் சம்முற்றப்படுத்த விரும்புகிறீர்கள் என்பதைத் தேர்வுசெய்யவும்.
te: మీ సైన్ ఇన్‌ను సురక్షితంగా ఎలా పూర్తి చేయాలనుకుంటున్నారో ఎంచుకోండి.

source: Select Loan
hi: ऋण चुनें
kn: ಸಾಲವನ್ನು ಆಯ್ಕೆಮಾಡಿ
mr: कर्ज निवडा
ta: கடனைத் தேர்ந்தெடுக்கவும்
te: రుణాన్ని ఎంచుకోండి

source: Select where to send your code
hi: चुनें कि आपका कोड कहाँ भेजना है
kn: ನಿಮ್ಮ ಕೋಡ್ ಅನ್ನು ಎಲ್ಲಿಗೆ ಕಳುಹಿಸಬೇಕು ಎಂದು ಆಯ್ಕೆಮಾಡಿ
mr: तुमचा कोड कुठे पाठवायचा ते निवडा
ta: உங்கள் குறியீட்டை எங்கு அனுப்புவது என்பதைத் தேர்ந்தெடுக்கவும்
te: మీ కోడ్‌ను ఎక్కడికి పంపాలో ఎంచుకోండి

source: Select your desired amount and repayment tenure.
hi: अपनी इच्छित राशि और पुनर्भुगतान अवधि चुनें।
kn: ನಿಮ್ಮ ಅಗತ್ಯದ ಮೊತ್ತ ಮತ್ತು ಮರುಪಾವತಿ ಅವಧಿಯನ್ನು ಆರಿಸಿ.
mr: इच्छित रक्कम आणि परतफेड कालावधी निवडा.
ta: உங்கள் விருப்பத் தொகையும் திருப்பிச் செலுத்தும் காலத்தையும் தேர்வு செய்யுங்கள்.
te: మీకు కావాల్సిన మొత్తం మరియు చెల్లింపు కాలాన్ని ఎంచుకోండి.

source: Selected document
hi: चयनित दस्तावेज़
kn: ಆಯ್ಕೆ ಮಾಡಿದ ದಾಖಲೆ
mr: निवडलेला दस्तऐवज
ta: தேர்ந்தெடுக்கப்பட்ட ஆவணம்
te: ఎంచుకున్న పత్రం

source: Session Expired
hi: सत्र समाप्त
kn: ಸೆಷನ್ ಅವಧಿ ಮುಗಿದಿದೆ
mr: सत्र कालबाह्य
ta: அமர்வு முடிந்தது
te: సెషన్ గడువు ముగిసింది

source: Set Up
hi: सेट अप करें
kn: ಸೆಟಪ್ ಮಾಡಿ
mr: सेट अप करा
ta: அமைக்கவும்
te: సెట్ అప్ చేయండి

source: Set up a real passkey
hi: एक वास्तविक पासकी सेट करें
mr: खरी पासकी सेट करा
ta: உண்மையான பாஸ்கீயை அமைக்கவும்
te: నిజమైన పాస్‌కీని సెటప్ చేయండి

source: Set up authenticator
hi: ऑथेंटिकेटर सेट करें
kn: ಆಥೆಂಟಿಕೇಟರ್ ಸೆಟಪ್ ಮಾಡಿ
mr: ऑथेंटिकेटर सेट करा
ta: Authenticator ஐ அமைக்கவும்
te: Authenticator ను సెటప్ చేయండి

source: Set up authenticator next
hi: अगले चरण में ऑथेंटिकेटर सेट करें
kn: ಮುಂದೆ ಆಥೆಂಟಿಕೇಟರ್ ಸೆಟಪ್ ಮಾಡಿ
mr: पुढे ऑथेंटिकेटर सेट करा
ta: அடுத்ததாக Authenticator ஐ அமைக்கவும்
te: తదుపరి Authenticator ను సెటప్ చేయండి

source: Settings
hi: सेटिंग्स
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು
mr: सेटिंग्ज
ta: அமைப்புகள்
te: సెట్టింగ్స్

source: Setup AutoPay
hi: AutoPay सेटअप करें
kn: AutoPay ಸೆಟಪ್ ಮಾಡಿ
mr: AutoPay सेटअप करा
ta: AutoPay அமைக்கவும்
te: AutoPay సెటప్ చేయండి

source: Sign In
hi: साइन इन
kn: ಸೈನ್ ಇನ್
mr: साइन इन
ta: உள்நுழைக
te: సైన్ ఇన్

source: Sign in securely with biometrics.
hi: बायोमेट्रिक्स के साथ सुरक्षित रूप से साइन इन करें।
kn: ಬಯೋಮೆಟ್ರಿಕ್ಸ್ ಬಳಸಿ ಸುರಕ್ಷಿತವಾಗಿ ಸೈನ್ ಇನ್ ಮಾಡಿ.
mr: बायोमेट्रिक्ससह सुरक्षितपणे साइन इन करा.
ta: உயிர்முறை அடையாளத்துடன் பாதுகாப்பாக உள்நுழைக.
te: బయోమెట్రిక్స్‌తో సురక్షితంగా సైన్ ఇన్ చేయండి.

source: Sign in with a different account
hi: किसी दूसरे खाते से साइन इन करें
kn: ಬೇರೆ ಖಾತೆಯಿಂದ ಸೈನ್ ಇನ್ ಮಾಡಿ
mr: वेगळ्या खात्याने साइन इन करा
ta: வேறு கணக்குடன் உள்நுழைக
te: వేరే ఖాతాతో సైన్ ఇన్ చేయండి

source: Sign in with passkey
hi: पासकी के साथ साइन इन करें
kn: ಪಾಸ್‌ಕಿ ಮೂಲಕ ಸೈನ್ ಇನ್ ಮಾಡಿ
mr: पासकीने साइन इन करा
ta: பாஸ்கீயுடன் உள்நுழைக
te: పాస్‌కీతో సైన్ ఇన్ చేయండి

source: Sign in with your email or phone number and password.
hi: अपने ईमेल या फ़ोन नंबर और पासवर्ड से साइन इन करें।
kn: ನಿಮ್ಮ ಇಮೇಲ್ ಅಥವಾ ಫೋನ್ ಸಂಖ್ಯೆ ಮತ್ತು ಪಾಸ್‌ವರ್ಡ್ ಬಳಸಿ ಸೈನ್ ಇನ್ ಮಾಡಿ.
mr: ईमेल किंवा फोन नंबर आणि पासवर्डने साइन इन करा.
ta: உங்கள் மின்னஞ்சல் அல்லது தொலைபேசி எண் மற்றும் கடவுச்சொல்லால் உள்நுழையுங்கள்.
te: మీ ఇమెయిల్ లేదా ఫోన్ నంబర్ మరియు పాస్‌వర్డ్‌తో సైన్ ఇన్ చేయండి.

source: Sign Up
hi: साइन अप करें
kn: ಸೈನ್ ಅಪ್
mr: साइन अप करा
ta: பதிவு செய்க
te: సైన్ అప్

source: Silver Tier
hi: सिल्वर टियर
kn: Silver ಹಂತ
mr: सिल्वर टियर
ta: சில்வர் நிலை
te: సిల్వర్ స్థాయి

source: Silver Tier Active
hi: सिल्वर टियर सक्रिय
kn: Silver ಹಂತ ಸಕ್ರಿಯವಾಗಿದೆ
mr: सिल्वर टियर सक्रिय
ta: சில்வர் நிலை செயலில்
te: సిల్వర్ స్థాయి సక్రియంగా ఉంది

source: Smart Financial Tools
hi: स्मार्ट वित्तीय उपकरण
kn: ಸ್ಮಾರ್ಟ್ ಆರ್ಥಿಕ ಸಾಧನಗಳು
mr: स्मार्ट आर्थिक साधने
ta: ஸ்மார்ட் நிதி கருவிகள்
te: స్మార్ట్ ఆర్థిక సాధనాలు

source: stacks up against standard market rates.
hi: मानक बाज़ार दरों की तुलना में है।
mr: मानक बाजार दरांशी तुलना करता.
ta: சாதாரண சந்தை விகிதங்களுடன் ஒப்பிடப்படுகிறது.
te: సాధారణ మార్కెట్ రేట్లతో పోలిస్తే.

source: Start Verification
hi: सत्यापन शुरू करें
kn: ಪರಿಶೀಲನೆ ಪ್ರಾರಂಭಿಸಿ
mr: पडताळणी सुरू करा
ta: சரிபார்ப்பை தொடங்கவும்
te: ధృవీకరణ ప్రారంభించండి

source: Starting at
hi: शुरुआत
kn: ಇಂದ ಪ್ರಾರಂಭ
mr: सुरुवात
ta: தொடக்கம்
te: ప్రారంభం

source: Starting at %@ p.a.
hi: %@ प्रतिवर्ष से शुरू
mr: %@ वार्षिक पासून सुरू
ta: %@ ஆண்டு விகிதத்தில் தொடக்கம்
te: %@ వార్షిక రేటు నుండి ప్రారంభం

source: State
hi: राज्य
kn: ರಾಜ್ಯ
mr: राज्य
ta: மாநிலம்
te: రాష్ట్రం

source: Statement
hi: स्टेटमेंट
kn: ಸ್ಟೇಟ್ಮೆಂಟ್
mr: स्टेटमेंट
ta: அறிக்கை
te: స్టేట్‌మెంట్

source: Status Details
hi: स्थिति विवरण
kn: ಸ್ಥಿತಿ ವಿವರಗಳು
mr: स्थिती तपशील
ta: நிலை விவரங்கள்
te: స్థితి వివరాలు

source: Step: Document Upload
hi: चरण: दस्तावेज़ अपलोड

source: Submit Application
hi: आवेदन जमा करें
kn: ಅರ್ಜಿಯನ್ನು ಸಲ್ಲಿಸಿ
mr: अर्ज सादर करा
ta: விண்ணப்பத்தை சமர்ப்பிக்கவும்
te: దరఖాస్తును సమర్పించండి

source: Support
hi: सहायता
kn: ಬೆಂಬಲ
mr: सपोर्ट
ta: ஆதரவு
te: సహాయం

source: Support & Chat
hi: सहायता और चैट
kn: ಬೆಂಬಲ ಮತ್ತು ಚಾಟ್
mr: सपोर्ट आणि चॅट
ta: ஆதரவு & அரட்டை
te: సహాయం & చాట్

source: Support Agent
hi: सहायता एजेंट
kn: ಬೆಂಬಲ ಪ್ರತಿನಿಧಿ

source: Talk to your Loan Officer
hi: अपने ऋण अधिकारी से बात करें
kn: ನಿಮ್ಮ ಸಾಲ ಅಧಿಕಾರಿಯೊಂದಿಗೆ ಮಾತನಾಡಿ
mr: तुमच्या कर्ज अधिकाऱ्याशी बोला
ta: உங்கள் கடன் அதிகாரியுடன் பேசுங்கள்
te: మీ రుణ అధికారితో మాట్లాడండి

source: Tamil (தமிழ்)
hi: तमिल (தமிழ்)
kn: ತಮಿಳು (தமிழ்)
mr: तमिळ (தமிழ்)
ta: தமிழ் (தமிழ்)
te: తమిళం (தமிழ்)

source: Tax Benefits
hi: कर लाभ
kn: ತೆರಿಗೆ ಪ್ರಯೋಜನಗಳು
mr: कर लाभ
ta: வரி நன்மைகள்
te: పన్ను ప్రయోజనాలు

source: Tell us about yourself
hi: अपने बारे में बताएं
kn: ನಿಮ್ಮ ಬಗ್ಗೆ ತಿಳಿಸಿ
mr: तुमच्याबद्दल सांगा
ta: உங்களைப் பற்றி சொல்லுங்கள்
te: మీ గురించి మాకు చెప్పండి

source: Telugu (తెలుగు)
hi: तेलुगु (తెలుగు)
kn: ತೆಲುಗು (తెలుగు)
mr: तेलुगू (తెలుగు)
ta: தெலுங்கு (తెలుగు)
te: తెలుగు (తెలుగు)

source: Tenure
hi: अवधि
kn: ಅವಧಿ
mr: कालावधी
ta: காலம்
te: కాలవ్యవధి
